## 01 Import Libraries

## 02 Import Pig. E Bank data

## 03 Data Consistency Check

## 01 Import Libraries

In [1]:
# Import libraries
import pandas as pd 
import numpy as np 
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

## 02 Import Pig E. Bank data

In [2]:
# import path of dataframe
path = r"C:\Users\bhimc\Documents\Pig E. Bank Analysis (Career Fuondry Rekha)"

In [3]:
path

'C:\\Users\\bhimc\\Documents\\Pig E. Bank Analysis (Career Fuondry Rekha)'

In [4]:
df_bank = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', '5.4-PigEBank-Client-Data set.csv'))

In [5]:
df_bank.head()

,Row_Number,Customer_ID,Last_Name,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,1,15634602,Hargrave,619.0,France,Female,42.0,2,$0.00,1,1,1,"$101,348.88",1
1,2,15647311,Hill,608.0,Spain,Female,41.0,1,"$83,807.86",1,0,1,"$112,542.58",0
2,3,15619304,Onio,502.0,France,Female,42.0,8,"$159,660.80",3,1,0,"$113,931.57",1
3,4,15701354,Boni,699.0,France,Female,39.0,1,$0.00,2,0,0,"$93,826.63",0
4,5,15737888,Mitchell,850.0,Spain,Female,43.0,2,"$125,510.82",1,1,1,"$79,084.10",0

In [6]:
df_bank.shape

(991, 14)

In [7]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 991 entries, 0 to 990
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Row_Number        991 non-null    int64
 1   Customer_ID       991 non-null    int64
 2   Last_Name         990 non-null    object
 3   Credit Score      988 non-null    float64
 4   Country           991 non-null    object
 5   Gender            990 non-null    object
 6   Age               990 non-null    float64
 7   Tenure            991 non-null    int64
 8   Balance           991 non-null    object
 9   NumOfProducts     991 non-null    int64
 10  HasCrCard?        991 non-null    int64
 11  IsActiveMember    991 non-null    int64
 12  Estimated Salary  989 non-null    object
 13  ExitedFromBank?   991 non-null    int64
dtypes: float64(2), int64(7), object(5)
memory usage: 108.5+ KB

In [8]:
df_bank.dtypes

Row_Number            int64
Customer_ID           int64
Last_Name            object
Credit Score        float64
Country              object
Gender               object
Age                 float64
Tenure                int64
Balance              object
NumOfProducts         int64
HasCrCard?            int64
IsActiveMember        int64
Estimated Salary     object
ExitedFromBank?       int64
dtype: object

In [9]:
df_bank.describe()

,Row_Number,Customer_ID,Credit Score,Age,Tenure,NumOfProducts,HasCrCard?,IsActiveMember,ExitedFromBank?
count,991.00000,9.910000e+02,988.000000,990.000000,991.000000,991.000000,991.000000,991.000000,991.000000
mean,496.00000,1.569232e+07,648.512146,38.684848,5.066599,1.522704,0.706357,0.507568,0.205853
std,286.22136,7.223333e+04,98.202853,10.958220,2.928371,0.573170,0.455660,0.500195,0.404527
min,1.00000,1.556609e+07,376.000000,2.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,248.50000,1.563019e+07,579.750000,32.000000,2.000000,1.000000,0.000000,0.000000,0.000000
50%,496.00000,1.569275e+07,653.500000,37.000000,5.000000,1.000000,1.000000,1.000000,0.000000
75%,743.50000,1.575379e+07,721.000000,44.000000,8.000000,2.000000,1.000000,1.000000,0.000000
max,991.00000,1.581536e+07,850.000000,82.000000,10.000000,4.000000,1.000000,1.000000,1.000000

## 03 Data Consistency Check

In [10]:
# Drop column "Row_number" and column "Last_name" because no longer needed for the analysiss
df_bank = df_bank.drop(columns = ['Row_Number', 'Last_Name'])

In [11]:
df_bank.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619.0,France,Female,42.0,2,$0.00,1,1,1,"$101,348.88",1
1,15647311,608.0,Spain,Female,41.0,1,"$83,807.86",1,0,1,"$112,542.58",0
2,15619304,502.0,France,Female,42.0,8,"$159,660.80",3,1,0,"$113,931.57",1
3,15701354,699.0,France,Female,39.0,1,$0.00,2,0,0,"$93,826.63",0
4,15737888,850.0,Spain,Female,43.0,2,"$125,510.82",1,1,1,"$79,084.10",0

In [12]:
# Change data type on column Customer_ID from Number to a string
df_bank['Customer_ID'] = df_bank['Customer_ID'].astype('str')

In [13]:
df_bank['Customer_ID'].dtype

dtype('O')

### Finding missing value in Pig E. Bank dataframe

In [14]:
# finnding missing value in dataframe
df_bank.isnull().sum()

Customer_ID         0
Credit Score        3
Country             0
Gender              1
Age                 1
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    2
ExitedFromBank?     0
dtype: int64

In [45]:
#View missing values in Estimated Salary
df_nan = df_bank[df_bank['Estimated Salary'].isnull()==True]

In [46]:
df_bank_updated = df_bank

In [104]:
#Replace missing value 'NaN' in 'Estimate Salary' column with '0'
df_bank_updated['Estimated Salary']=df_bank_updated['Estimated Salary'].fillna(df_bank_updated['Estimated Salary'].median())

In [ ]:
df_bank['Estimated Salary'] = df_bank['Estimated Salary'].str.replace(',', '')

In [ ]:
df_bank['Estimated Salary'] = df_bank['Estimated Salary'].str.replace('$', '')

In [53]:
df_bank['Estimated Salary']

0      101348.88
1      112542.58
2      113931.57
3       93826.63
4       79084.10
         ...
986     79616.37
987    102299.81
988    104533.51
989    140765.57
990     66214.13
Name: Estimated Salary, Length: 991, dtype: float64

In [19]:
# changing data type for Statement_salary column from string to 'float'
df_bank['Estimated Salary'] = df_bank['Estimated Salary'].astype('float')

In [31]:
#View 3 missing values in Credit Score\n",
df_nan = df_bank[df_bank['Credit Score'].isnull()==True]

In [32]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
204,15627801,NaN,ES,Male,33.0,3,176666.62,1,1,0,94670.77,0
214,15785542,NaN,DE,Male,26.0,4,118287.01,2,0,0,NaN,0
976,15570060,NaN,France,Female,43.0,8,132558.26,1,1,0,67046.83,1

In [33]:
# Replace missing value 'NaN'  with mean in "Credit Score" colum
df_bank_updated = df_bank

In [34]:
df_bank_updated['Credit Score']=df_bank_updated['Credit Score'].fillna(df_bank_updated['Credit Score'].mean())

In [35]:
df_bank_updated.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 991 entries, 0 to 990
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Customer_ID       991 non-null    object
 1   Credit Score      991 non-null    float64
 2   Country           991 non-null    object
 3   Gender            990 non-null    object
 4   Age               990 non-null    float64
 5   Tenure            991 non-null    int64
 6   Balance           991 non-null    float64
 7   NumOfProducts     991 non-null    int64
 8   HasCrCard?        991 non-null    object
 9   IsActiveMember    991 non-null    object
 10  Estimated Salary  989 non-null    float64
 11  ExitedFromBank?   991 non-null    object
dtypes: float64(4), int64(2), object(6)
memory usage: 93.0+ KB

In [37]:
#View missing values in 'Gender' column
df_nan = df_bank[df_bank['Gender'].isnull()==True]

In [38]:
df_bank_updated = df_bank

In [39]:
#Replace missing value 'NaN' in 'Gender' column with 'mode'
df_bank_updated['Gender']=df_bank_updated['Gender'].fillna(df_bank_updated['Gender'].mode())

In [40]:
# View missing values in 'Age' column
df_nan = df_bank[df_bank['Age'].isnull()==True]

In [41]:
df_bank_updated = df_bank

In [42]:
#Replace missing value 'NaN' in 'Age' column with 'median'
df_bank_updated['Age']=df_bank_updated['Age'].fillna(df_bank_updated['Age'].median())

In [20]:
# Strip '$' and ' ', from the Balance column
df_bank['Balance'] = df_bank['Balance'].str.replace(',', '')

In [21]:
df_bank['Balance'] = df_bank['Balance'].str.replace('$', '')

In [54]:
df_bank['Balance']

0           0.00
1       83807.86
2      159660.80
3           0.00
4      125510.82
         ...
986    142120.91
987    151839.26
988    149620.88
989    168197.66
990     93147.00
Name: Balance, Length: 991, dtype: float64

In [23]:
# changing data type for 'Balance' column from string to 'float'
df_bank['Balance'] = df_bank['Balance'].astype('float')

In [24]:
# Changing data type for column 'Has CrCard ?'  from number to string
df_bank['HasCrCard?'] = df_bank['HasCrCard?'].astype('str')

In [25]:
# Changing data type for column 'IsActiveMember' from number to string
df_bank['IsActiveMember'] = df_bank['IsActiveMember'].astype('str')

In [26]:
# Changing data type for column 'ExistedFromBank' from number to string
df_bank['ExitedFromBank?'] = df_bank['ExitedFromBank?'].astype('str')

In [55]:
df_bank.dtypes

Customer_ID          object
Credit Score          int32
Country              object
Gender               object
Age                 float64
Tenure                int64
Balance             float64
NumOfProducts         int64
HasCrCard?           object
IsActiveMember       object
Estimated Salary    float64
ExitedFromBank?      object
dtype: object

In [28]:
df_bank.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619.0,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,15647311,608.0,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,15619304,502.0,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,15701354,699.0,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,15737888,850.0,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [43]:
# Changing data type on column 'Credit Score' from a float to a number
df_bank['Credit Score'] = df_bank['Credit Score'].astype('int')

In [56]:
df_bank.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

## Replace Country name{ FR, ES, DE} with full country name

In [57]:
# Replaace FR with 'French'
df_bank['Country'].replace('FR', 'France', inplace=True)

In [59]:
# Replace ES with "Spain"
df_bank['Country'].replace('ES', 'Spain', inplace=True)

In [60]:
# Replace De with'Germany'
df_bank['Country'].replace('DE', 'Germany', inplace=True)

In [61]:
print(df_bank)

    Customer_ID  Credit Score Country  Gender   Age  Tenure    Balance  \
0      15634602           619  France  Female  42.0       2       0.00
1      15647311           608   Spain  Female  41.0       1   83807.86
2      15619304           502  France  Female  42.0       8  159660.80
3      15701354           699  France  Female  39.0       1       0.00
4      15737888           850   Spain  Female  43.0       2  125510.82
..          ...           ...     ...     ...   ...     ...        ...
986    15655339           566  France    Male  36.0       1  142120.91
987    15613749           569   Spain    Male  34.0       0  151839.26
988    15664521           659   Spain    Male  31.0       7  149620.88
989    15681206           722  France  Female  49.0       3  168197.66
990    15745527           655  France    Male  37.0       5   93147.00

     NumOfProducts HasCrCard? IsActiveMember  Estimated Salary ExitedFromBank?
0                1          1              1         101348.88               1
1                1          0              1         112542.58               0
2                3          1              0         113931.57               1
3                2          0              0          93826.63               0
4                1          1              1          79084.10               0
..             ...        ...            ...               ...             ...
986              1          1              0          79616.37               0
987              1          1              0         102299.81               1
988              2          1              1         104533.51               0
989              1          1              0         140765.57               1
990              2          1              0          66214.13               0

[991 rows x 12 columns]

In [62]:
df_bank['Age'] = df_bank['Age'].astype('int')

In [63]:
print(df_bank)

    Customer_ID  Credit Score Country  Gender  Age  Tenure    Balance  \
0      15634602           619  France  Female   42       2       0.00
1      15647311           608   Spain  Female   41       1   83807.86
2      15619304           502  France  Female   42       8  159660.80
3      15701354           699  France  Female   39       1       0.00
4      15737888           850   Spain  Female   43       2  125510.82
..          ...           ...     ...     ...  ...     ...        ...
986    15655339           566  France    Male   36       1  142120.91
987    15613749           569   Spain    Male   34       0  151839.26
988    15664521           659   Spain    Male   31       7  149620.88
989    15681206           722  France  Female   49       3  168197.66
990    15745527           655  France    Male   37       5   93147.00

     NumOfProducts HasCrCard? IsActiveMember  Estimated Salary ExitedFromBank?
0                1          1              1         101348.88               1
1                1          0              1         112542.58               0
2                3          1              0         113931.57               1
3                2          0              0          93826.63               0
4                1          1              1          79084.10               0
..             ...        ...            ...               ...             ...
986              1          1              0          79616.37               0
987              1          1              0         102299.81               1
988              2          1              1         104533.51               0
989              1          1              0         140765.57               1
990              2          1              0          66214.13               0

[991 rows x 12 columns]

In [64]:
df_bank['Country'].value_counts(dropna=False)

Country
France     480
Germany    257
Spain      254
Name: count, dtype: int64

In [66]:
df_bank['Age'].replace('2', 'N/A', inplace=True)

In [67]:
df_bank['Age'].value_counts(dropna=False)

Age
36    59
35    55
37    46
34    46
31    43
      ..
68     1
80     1
73     1
79     1
74     1
Name: count, Length: 61, dtype: int64

In [68]:
df_bank.describe()

,Credit Score,Age,Tenure,Balance,NumOfProducts,Estimated Salary
count,991.000000,991.000000,991.000000,991.000000,991.000000,991.000000
mean,648.510595,38.683148,5.066599,78002.718063,1.522704,98375.603471
std,98.053952,10.952815,2.928371,62799.237345,0.573170,57337.973866
min,376.000000,2.000000,0.000000,0.000000,1.000000,0.000000
25%,580.000000,32.000000,2.000000,0.000000,1.000000,47991.320000
50%,653.000000,37.000000,5.000000,98668.180000,1.000000,98301.610000
75%,721.000000,44.000000,8.000000,129461.850000,2.000000,146236.190000
max,850.000000,82.000000,10.000000,213146.200000,4.000000,199725.390000

In [69]:
df_bank['Estimated Salary'].value_counts(dropna=False)

Estimated Salary
0.00         2
101348.88    1
160941.78    1
9567.39      1
132210.49    1
            ..
174652.51    1
2010.98      1
14109.85     1
43527.40     1
66214.13     1
Name: count, Length: 990, dtype: int64

In [70]:
df_bank_updated = df_bank

In [71]:
df_bank_updated['Estimated Salary']=df_bank_updated['Estimated Salary'].fillna(df_bank_updated['Estimated Salary'].median())

In [105]:
df_bank_updated['Estimated Salary'].value_counts(dropna=False)

Estimated Salary
0.00         2
101348.88    1
160941.78    1
9567.39      1
132210.49    1
            ..
174652.51    1
2010.98      1
14109.85     1
43527.40     1
66214.13     1
Name: count, Length: 990, dtype: int64

In [73]:
#Finding missing values in df_bank_updated dataframe
df_bank_updated.isnull().sum()

Customer_ID         0
Credit Score        0
Country             0
Gender              1
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    0
ExitedFromBank?     0
dtype: int64

In [74]:
df_bank['Gender'].replace('F', 'Female', inplace=True)

In [76]:
df_bank['Gender'].replace('M', 'Male', inplace=True)

In [77]:
df_bank['Gender']

0      Female
1      Female
2      Female
3      Female
4      Female
        ...
986      Male
987      Male
988      Male
989    Female
990      Male
Name: Gender, Length: 991, dtype: object

In [78]:
df_bank['Gender'].value_counts(dropna=False)

Gender
Male      528
Female    462
NaN         1
Name: count, dtype: int64

In [79]:
df_nan = df_bank[df_bank['Gender'].isnull()==True]

In [89]:
df_nan

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
11,15737173,497,Spain,NaN,24,3,0.0,2,1,0,76390.01,0

In [93]:
df_bank_updated['Gender']=df_bank_updated['Gender'].fillna(df_bank_updated['Gender'].mode())

In [98]:
df_bank_updated['Gender']=df_bank_updated['Gender'].fillna('Male')

In [99]:
df_bank['Gender'].value_counts(dropna=False)

Gender
Male      529
Female    462
Name: count, dtype: int64

In [101]:
df_bank.describe()

,Credit Score,Age,Tenure,Balance,NumOfProducts,Estimated Salary
count,991.000000,991.000000,991.000000,991.000000,991.000000,991.000000
mean,648.510595,38.683148,5.066599,78002.718063,1.522704,98375.603471
std,98.053952,10.952815,2.928371,62799.237345,0.573170,57337.973866
min,376.000000,2.000000,0.000000,0.000000,1.000000,0.000000
25%,580.000000,32.000000,2.000000,0.000000,1.000000,47991.320000
50%,653.000000,37.000000,5.000000,98668.180000,1.000000,98301.610000
75%,721.000000,44.000000,8.000000,129461.850000,2.000000,146236.190000
max,850.000000,82.000000,10.000000,213146.200000,4.000000,199725.390000

In [108]:
df_bank_updated.isnull().sum()

Customer_ID         0
Credit Score        0
Country             0
Gender              0
Age                 0
Tenure              0
Balance             0
NumOfProducts       0
HasCrCard?          0
IsActiveMember      0
Estimated Salary    0
ExitedFromBank?     0
dtype: int64

In [114]:
# Checking mix type in column
df_bank_updated.columns

Index(['Customer_ID', 'Credit Score', 'Country', 'Gender', 'Age', 'Tenure',
       'Balance', 'NumOfProducts', 'HasCrCard?', 'IsActiveMember',
       'Estimated Salary', 'ExitedFromBank?'],
      dtype='object')

In [119]:
#Finding duplicates
df_bank_dups = df_bank[df_bank.duplicated()]

In [120]:
df_bank_dups

Empty DataFrame
Columns: [Customer_ID, Credit Score, Country, Gender, Age, Tenure, Balance, NumOfProducts, HasCrCard?, IsActiveMember, Estimated Salary, ExitedFromBank?]
Index: []

## There are no duplicate data found

## Export Final cleaned df_bank dataframe

In [123]:
df_bank.head()

,Customer_ID,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [124]:
df_bank.to_csv(os.path.join(path, '02 Data','Prepared Data', 'df_PigE_bank_cleaned.csv'))